Tekla.Structures.Model.BaseWeld
The BaseWeld abstract class defines a weld between two model objects.

Tekla.Structures.Model.BaseWeld.referenceText
Private member to hold the reference text.

Tekla.Structures.Model.BaseWeld.prefixAboveLine
Private member to hold the prefix above the line information.

Tekla.Structures.Model.BaseWeld.prefixBelowLine
Private member to hold the prefix below the line information.

Tekla.Structures.Model.BaseWeld.standard
Private member to hold the weld detail/standard infromation.

Tekla.Structures.Model.BaseWeld.weldNumberPrefix
Private member to hold the weld number prefix information.

Tekla.Structures.Model.BaseWeld.intermittentType
Private member to hold weld intermittent type information.

Tekla.Structures.Model.BaseWeld.placement
Private member to hold weld placement information.

Tekla.Structures.Model.BaseWeld.preparation
Private member to hold weld preaparation information.

Tekla.Structures.Model.BaseWeld.logicalWeldId
Defines the Logical Weld ID. Is equal to 0 if Weld is not Child.

Tekla.Structures.Model.BaseWeld.#ctor
Initializes a new instance of the Tekla.Structures.Model.BaseWeld class.

Tekla.Structures.Model.BaseWeld.MainObject
Gets or sets the main part of the weld.

Tekla.Structures.Model.BaseWeld.SecondaryObject
Gets or sets the secondary part of the weld.

Tekla.Structures.Model.BaseWeld.SizeAbove
Gets or sets the size above.

Tekla.Structures.Model.BaseWeld.AdditionalSizeAbove
Gets or sets the additional size above for combination welds.

Tekla.Structures.Model.BaseWeld.TypeAbove
Gets or sets the type above.

Tekla.Structures.Model.BaseWeld.AngleAbove
Gets or sets the angle above.

Tekla.Structures.Model.BaseWeld.LengthAbove
Gets or sets the length above.

Tekla.Structures.Model.BaseWeld.ContourAbove
Gets or sets the contour above.

Tekla.Structures.Model.BaseWeld.FinishAbove
Gets or sets the finish above.

Tekla.Structures.Model.BaseWeld.PitchAbove
Gets or sets the pitch above.

Tekla.Structures.Model.BaseWeld.SizeBelow
Gets or sets the size below.

Tekla.Structures.Model.BaseWeld.AdditionalSizeBelow
Gets or sets the additional size below for combination welds.

Tekla.Structures.Model.BaseWeld.TypeBelow
Gets or sets the type below.

Tekla.Structures.Model.BaseWeld.AngleBelow
Gets or sets the angle below.

Tekla.Structures.Model.BaseWeld.LengthBelow
Gets or sets the length below.

Tekla.Structures.Model.BaseWeld.ContourBelow
Gets or sets the contour below.

Tekla.Structures.Model.BaseWeld.FinishBelow
Gets or sets the finish below.

Tekla.Structures.Model.BaseWeld.PitchBelow
Gets or sets the pitch below.

Tekla.Structures.Model.BaseWeld.ShopWeld
Gets or sets a value indicating whether
the weld is a shop weld (true) or a site weld (false).

Tekla.Structures.Model.BaseWeld.AroundWeld
Gets or sets a value indicating whether
the weld is an around weld (true) or an edge weld (false).

Tekla.Structures.Model.BaseWeld.StitchWeld
Gets or sets a value indicating whether
the weld is stitched (true) or not stitched (false).

Tekla.Structures.Model.BaseWeld.RootOpeningAbove
Gets or sets the root opening above.

Tekla.Structures.Model.BaseWeld.RootFaceAbove
Gets or sets the root face above.

Tekla.Structures.Model.BaseWeld.EffectiveThroatAbove
Gets or sets the effective throat above.

Tekla.Structures.Model.BaseWeld.IncrementAmountAbove
Gets or sets the increment amount above.

Tekla.Structures.Model.BaseWeld.RootOpeningBelow
Gets or sets the root opening below.

Tekla.Structures.Model.BaseWeld.RootFaceBelow
Gets or sets the root face below.

Tekla.Structures.Model.BaseWeld.EffectiveThroatBelow
Gets or sets the effective throat below.

Tekla.Structures.Model.BaseWeld.IncrementAmountBelow
Gets or sets the increment amount below.

Tekla.Structures.Model.BaseWeld.ElectrodeClassification
Gets or sets the weld electrode classification.

Tekla.Structures.Model.BaseWeld.ElectrodeStrength
Gets or sets the electrode strength.

Tekla.Structures.Model.BaseWeld.ElectrodeCoefficient
Gets or sets the electrode strength coefficient.

Tekla.Structures.Model.BaseWeld.ProcessType
Gets or sets the process type.

Tekla.Structures.Model.BaseWeld.NDTInspection
Gets or sets the NDT inspection level.

Tekla.Structures.Model.BaseWeld.ConnectAssemblies
Gets or sets a value indicating whether
to connect a part or an assembly as a secondary part (false)
or as a sub-assembly (true).

Tekla.Structures.Model.BaseWeld.ReferenceText
Gets or sets the reference text.

Tekla.Structures.Model.BaseWeld.PrefixAboveLine
Gets or sets the size prefix above the line.

Tekla.Structures.Model.BaseWeld.PrefixBelowLine
Gets or sets the size prefix below the line.

Tekla.Structures.Model.BaseWeld.Standard
Gets or sets the weld detail/standard.

Tekla.Structures.Model.BaseWeld.WeldNumber
Gets the weld number.

Tekla.Structures.Model.BaseWeld.WeldNumberPrefix
Gets or sets the weld number prefix.

Tekla.Structures.Model.BaseWeld.IntermittentType
Gets or sets the weld intermittent type.
Throws System.ArgumentException: Thrown when provided value is not defined in the WeldIntermittentTypeEnum.

Tekla.Structures.Model.BaseWeld.Placement
Gets or sets the weld placement.
Throws System.ArgumentException: Thrown when provided value is not defined in the WeldPlacementTypeEnum.

Tekla.Structures.Model.BaseWeld.Preparation
Gets or sets the weld preparation.
Throws System.ArgumentException: Thrown when provided value is not defined in the WeldPreparationTypeEnum.

Tekla.Structures.Model.BaseWeld.GetWeldGeometries
Method for getting weld seam geometries.
Every result represents one individual seam geometry in current weld.
Returns: An array list that contains weld seam specific WeldGeometry objects.

Tekla.Structures.Model.BaseWeld.GetSolid
Method for getting the weld solid.
Returns: Weld solid.

Tekla.Structures.Model.BaseWeld.GetLogicalWeldID
Method for getting the logical weld id.
Returns: Logical weld id.

Tekla.Structures.Model.BaseWeld.SetLogicalWeldID(System.Int32)
Method for setting the logical weld id.
weldId: Logical weld id.

Tekla.Structures.Model.BaseWeld.ToStruct(Tekla.Structures.ModelInternal.dotWeld_t@)
Method for populating dotWeld_t struct from the BaseWeld object.
p: Reference to the dotWeld_t struct to be populated.

Tekla.Structures.Model.BaseWeld.FromStruct(Tekla.Structures.ModelInternal.dotWeld_t@)
Method for populating the BaseWeld object data from the dotWeld_t struct.
p: Reference to the dotWeld_t struct to be used in populating the BaseWeld data.